define(function(require) {
    require('./changecity');   

    (function(b) {
        var a = {
            _data: [{
                id: "rm",
                type: 0,
                name: "热门城市",
                city: "北京,上海,广州,深圳,天津,重庆"
            }, {
                id: "ah",
                type: 0,
                name: "安徽",
                city: "蚌埠,合肥,阜阳,芜湖,安庆,亳州,滁州,宣城,淮南,巢湖,黄山,淮北,六安,池州,铜陵,马鞍山,宿州"
            }, {
                id: "fj",
                type: 0,
                name: "福建",
                city: "南平,泉州,宁德,龙岩,厦门,莆田,三明,漳州,福州"
            }, {
                id: "gs",
                type: 0,
                name: "甘肃",
                city: "金昌,白银,兰州,酒泉,张掖,武威,庆阳,定西,临夏回族自治州,天水,甘南藏族自治州,陇南,平凉"
            }, {
                id: "gd",
                type: 0,
                name: "广东",
                city: "东莞,东沙群岛,韶关,佛山,茂名,珠海,梅州,中山,清远,湛江,阳江,河源,潮州,广州,云浮,揭阳,惠州,江门,汕头,肇庆,汕尾,深圳"
            }, {
                id: "gx",
                type: 0,
                name: "广西",
                city: "桂林,河池,崇左,钦州,来宾,百色,防城港,贺州,南宁,北海,梧州,柳州,贵港,玉林"
            }, {
                id: "gz",
                type: 0,
                name: "贵州",
                city: "贵阳,六盘水,铜仁,毕节,遵义,安顺,黔南布依族苗族自治州,黔东南苗族侗族自治州,黔西南布依族苗族自治州"
            }, {
                id: "hin",
                type: 0,
                name: "海南",
                city: "三亚,海口,定安,儋州,万宁,保亭黎族苗族自治县,西沙群岛,中沙群岛,南沙群岛,屯昌县,昌江黎族自治县,陵水黎族自治县,五指山,琼中黎族苗族自治县,乐东黎族自治县,临高县,琼海,白沙黎族自治县,东方,澄迈,文昌"
            }, {
                id: "heb",
                type: 0,
                name: "河北",
                city: "秦皇岛,沧州,石家庄,邯郸,廊坊,承德,衡水,张家口,唐山,邢台,保定"
            }, {
                id: "hen",
                type: 0,
                name: "河南",
                city: "新乡,洛阳,商丘,许昌,濮阳,开封,焦作,三门峡,平顶山,信阳,鹤壁,安阳,郑州,驻马店,周口,南阳,漯河,济源"
            }, {
                id: "hlj",
                type: 0,
                name: "黑龙江",
                city: "大兴安岭地区,黑河,伊春,齐齐哈尔,佳木斯,鹤岗,绥化,双鸭山,鸡西,七台河,哈尔滨,牡丹江,大庆"
            }, {
                id: "hub",
                type: 0,
                name: "湖北",
                city: "鄂州,襄樊,荆州,十堰,荆门,武汉,宜昌,黄冈,孝感,黄石,咸宁,随州,恩施土家族苗族自治州,潜江,仙桃,天门,神农架林区"
            }, {
                id: "hun",
                type: 0,
                name: "湖南",
                city: "长沙,衡阳,常德,岳阳,娄底,株洲,益阳,邵阳,湘西土家族苗族自治州,郴州,张家界,湘潭,永州,怀化"
            }, {
                id: "js",
                type: 0,
                name: "江苏",
                city: "镇江,南通,淮安,盐城,苏州,泰州,宿迁,南京,徐州,无锡,扬州,连云港,常州"
            }, {
                id: "jx",
                type: 0,
                name: "江西",
                city: "南昌,新余,景德镇,抚州,宜春,鹰潭,吉安,九江,萍乡,上饶,赣州"
            }, {
                id: "jl",
                type: 0,
                name: "吉林",
                city: "白城,松原,长春,延边朝鲜族自治州,吉林,四平,白山,通化,辽源"
            }, {
                id: "ln",
                type: 0,
                name: "辽宁",
                city: "沈阳,阜新,铁岭,锦州,大连,抚顺,本溪,盘锦,朝阳,营口,丹东,葫芦岛,鞍山,辽阳"
            }, {
                id: "nmg",
                type: 0,
                name: "内蒙古",
                city: "呼伦贝尔,兴安盟,锡林郭勒盟,通辽,乌海,乌兰察布,巴彦淖尔,包头,阿拉善盟,鄂尔多斯,赤峰,呼和浩特"
            }, {
                id: "nx",
                type: 0,
                name: "宁夏",
                city: "中卫,固原,吴忠,石嘴山,银川"
            }, {
                id: "qh",
                type: 0,
                name: "青海",
                city: "海西蒙古族藏族自治州,西宁,海北藏族自治州,海南藏族自治州,海东地区,黄南藏族自治州,玉树藏族自治州,果洛藏族自治州"
            }, {
                id: "sd",
                type: 0,
                name: "山东",
                city: "莱芜,枣庄,日照,东营,威海,临沂,滨州,青岛,济宁,潍坊,济南,泰安,烟台,菏泽,淄博,聊城,德州"
            }, {
                id: "sx",
                type: 0,
                name: "山西",
                city: "太原,朔州,晋中,晋城,吕梁,运城,大同,长治,阳泉,忻州,临汾"
            }, {
                id: "shx",
                type: 0,
                name: "陕西",
                city: "渭南,宝鸡,榆林,铜川,西安,延安,商洛,咸阳,安康,汉中"
            }, {
                id: "sc",
                type: 0,
                name: "四川",
                city: "甘孜藏族自治州,德阳,成都,雅安,眉山,自贡,乐山,凉山彝族自治州,攀枝花,阿坝藏族羌族自治州,宜宾,巴中,绵阳,广安,资阳,内江,南充,广元,遂宁,泸州,达州"
            }, {
                id: "xz",
                type: 0,
                name: "西藏",
                city: "山南地区,林芝地区,昌都地区,拉萨,那曲地区,日喀则地区,阿里地区"
            }, {
                id: "xj",
                type: 0,
                name: "新疆",
                city: "和田地区,喀什地区,克孜勒苏柯尔克孜自治州,阿克苏地区,巴音郭楞蒙古自治州,博尔达拉蒙古自治州,吐鲁番地区,伊犁哈萨克地区,哈密地区,乌鲁木齐,昌吉回族自治州,塔城地区,克拉玛依,阿勒泰地区,阿拉尔,石河子,五家渠,图木舒克"
            }, {
                id: "yn",
                type: 0,
                name: "云南",
                city: "昆明,楚雄彝族自治州,红河哈尼族彝族自治州,普洱,西双版纳傣族自治州,临沧,大理白族自治州,保山,怒江傈傈族自治州,丽江,迪庆藏族自治州,德宏傣族景颇族自治州,文山壮族苗族自治州,曲靖,昭通"
            }, {
                id: "zj",
                type: 0,
                name: "浙江",
                city: "温州,杭州,宁波,衢州,台州,舟山,丽水,绍兴,湖州,金华,嘉兴"
            }, {
                id: "xg",
                type: 1,
                name: "香港"
            }, {
                id: "am",
                type: 1,
                name: "澳门"
            }],
            _city: {
                code: "010",
                name: "北京",
                x: "116.397945",
                y: "39.90817"
            },
            citycode: function() {
                return a._city.code && a._city.name || a._city.name
            },
            cityname: function() {
                return a._city.name
            },
            citylnglat: function() {
                return new so.maps.LatLng(a._city.y, a._city.x)
            },
            setCity: function(name, code, x, y) {
                this._city = {
                    code: code,
                    name: name,
                    x: Number(x),
                    y: Number(y)
                }
            },
            getData: function() {
                return this._data
            }
        };
        So[b] = a
    })("CityData");
});
