define(function(require, exports, module) {
    var categories = {
        data: {
            '美食': ['餐饮', '中餐馆', '快餐', '咖啡厅', '面包西点', '肯德基', '麦当劳', '必胜客', '西餐厅'],
            '休闲娱乐': ['电影院', 'KTV', '洗浴', '网吧', '台球厅', '酒吧', '茶艺馆', '游泳', '公园', '景点'],
            '交通': ['加油站', '停车场', '公交站', '地铁站', '长途汽车站', '火车票代售点'],
            '银行': ['银行', '招商银行', '工商银行', '中国银行', '建设银行', '农业银行', '交通银行', '邮政储蓄', 'ATM'],
            '酒店': ['酒店', '宾馆', '快捷酒店', '招待所', '青年旅社', '三星级', '四星级', '五星级'],
            '生活服务': ['电信营业厅', '移动营业厅', '联通营业厅', '药店', '医院诊所', '邮局', '图书馆', '学校', '美容美发', '摄影冲印', '公共厕所'],
            '购物': ['书店', '家居建材', '百货商场', '体育用品', '超市', '邮局'],
            '汽车服务': ['洗车场', '汽车维修', '汽车租赁', '汽车服务'],
            '公共设施': ['公共厕所', '地铁站', '公园', '公交站']
        },
        getParentName: function(catname) {
            var data = categories.data;
            for (var key in data) {
                var sub_cats = data[key];
                if (sub_cats.indexOf(catname) != -1) {
                    return key;
                }
            }
        }
    };
    return categories;
});
