define(function(){
    /*数组中第一项用于显示，第二项用于搜索，如果没有第二项，则用第一项搜索*/
    var groupId = {
        '1': {
            title: '休闲娱乐',
            querys:[
                ['KTV'],
                ['酒吧'],
                ['桌游吧'],
                ['棋牌室'],
                ['网吧'],
                ['台球馆'],
                ['密室逃脱'],
                ['手工DIY'],
                ['真人CS']
            ]
        },
        '2': {
            title: '户外游玩',
            querys:[
                ['著名景区', '景点'],
                ['城市公园', '公园'],
                ['主题公园'],
                ['水上世界'],
                ['农家乐'],
                ['温泉'],
                ['滑雪'],
                ['真人CS']
            ]
        },
        '3': {
            title: '亲子时光',
            querys:[
                ['儿童乐园'],
                ['主题公园'],
                ['水上世界'],
                ['游乐园'],
                ['4D/5D电影', '4D电影']
            ]
        },
        '4': {
            title: '城市味道',
            show_by_city: 1,
            city_querys:{
                '北京':[
                    ['烤鸭'],
                    ['涮羊肉'],
                    ['羊蝎子'],
                    ['炸酱面', '北京炸酱面'],
                    ['炒肝儿'],
                    ['卤煮', '卤煮小肠'],
                    ['爆肚', '老北京爆肚'],
                    ['老北京烤肉'],
                    ['京酱肉丝'],
                    ['酱爆鸡丁'],
                    ['炒疙瘩'],
                    ['葱爆羊肉']
                ],
                '上海':[
                    ['生煎'],
                    ['上海小笼包'],
                    ['排骨年糕'],
                    ['辣酱面'],
                    ['油爆虾'],
                    ['糖醋小排'],
                    ['腌笃鲜'],
                    ['鸡骨酱'],
                    ['红烧回鱼'],
                    ['虾子大乌参'],
                    ['草头圈子'],
                    ['八宝鸭']
                ],
                '广州':[
                    ['肥肠粉'],
                    ['艇仔粥'],
                    ['萝卜牛腩'],
                    ['炒河粉'],
                    ['云吞面'],
                    ['烧乳猪'],
                    ['烧腊', '烧腊拼盘'],
                    ['白切鸡'],
                    ['老火靓汤']
                ],
                '深圳':[
                    ['大盆菜'],
                    ['猪肚包鸡'],
                    ['烤乳鸽'],
                    ['香辣鸡煲'],
                    ['牛肉丸', '潮州牛肉丸'],
                    ['叉烧酥'],
                    ['猪脚姜'],
                    ['白切鸡'],
                    ['煲仔饭']
                ],
                '郑州':[
                    ['烩面'],
                    ['胡辣汤'],
                    ['桶子鸡'],
                    ['焖饼'],
                    ['羊肉汤'],
                    ['烧鸡', '道口烧鸡'],
                    ['郑州烤鸭', '烤鸭'],
                    ['水煎包'],
                    ['小酥肉']
                ],
                '天津':[
                    ['狗不理包子'],
                    ['麻花', '什锦麻花'],
                    ['锅巴菜'],
                    ['棒棒鸡'],
                    ['水爆肚'],
                    ['八大碗'],
                    ['老爆三'],
                    ['煎饼果子'],
                    ['糖炒栗子']
                ],
                '温州':[
                    ['三鲜面'],
                    ['猪脏粉'],
                    ['敲鱼汤']
                ],
                '南京':[
                    ['蟹黄包'],
                    ['鸭血粉丝汤'],
                    ['牛肉锅贴'],
                    ['盐水鸭'],
                    ['煮干丝'],
                    ['糯米藕'],
                    ['桂花糖芋苗'],
                    ['长鱼面'],
                    ['板鸭']
                ],
                '杭州':[
                    ['西湖醋鱼'],
                    ['东坡肉'],
                    ['杭州酱鸭'],
                    ['龙井虾仁'],
                    ['鱼头豆腐'],
                    ['虾爆鳝面'],
                    ['西湖莼菜汤'],
                    ['宋嫂鱼羹'],
                    ['西湖牛肉羹'],
                    ['叫花童子鸡'],
                    ['蜜汁火方'],
                    ['清汤鱼圆'],
                ],
                '洛阳':[
                    ['烩面'],
                    ['胡辣汤'],
                    ['洛阳燕菜'],
                    ['腐乳肉'],
                    ['浆面条'],
                    ['羊肉汤'],
                    ['牛肉汤'],
                    ['驴肉汤'],
                    ['丸子汤']
                ],
                '武汉':[
                    ['热干面'],
                    ['三鲜豆皮'],
                    ['武昌鱼', '清蒸武昌鱼'],
                    ['麻辣鸭脖'],
                    ['沔阳三蒸'],
                    ['油焖大虾'],
                    ['糊汤粉'],
                    ['排骨莲藕汤'],
                    ['面窝']
                ],
                '西安':[
                    ['羊肉泡馍'],
                    ['凉皮', '麻酱凉皮'],
                    ['肉夹馍'],
                    ['葫芦头', '优质葫芦头'],
                    ['油泼扯面'],
                    ['岐山哨子面'],
                    ['涮牛肚'],
                    ['葫芦鸡'],
                    ['烩麻食']
                ],
                '合肥':[
                    ['蟹黄汤包'],
                    ['李鸿章大杂烩'],
                    ['吴山贡鹅'],
                    ['肥西母鸡汤', '肥西老母鸡汤'],
                    ['庐州烤鸭', '烤鸭'],
                    ['臭鳜鱼']
                ],
                '成都':[
                    ['担担面'],
                    ['火锅', '鸳鸯火锅'],
                    ['冒菜', '什锦冒菜'],
                    ['豆花', '酸辣豆花'],
                    ['串串香'],
                    ['抄手', '红油抄手'],
                    ['兔头', '香辣兔头'],
                    ['夫妻肺片'],
                    ['三大炮']
                ],
                '福州':[
                    ['鱼丸', '福州鱼丸'],
                    ['荔枝肉'],
                    ['佛跳墙'],
                    ['锅边糊'],
                    ['肉燕'],
                    ['油酥肉松']
                ],
                '重庆':[
                    ['酸辣粉'],
                    ['火锅', '麻辣火锅'],
                    ['毛血旺'],
                    ['烤鱼'],
                    ['泉水鸡'],
                    ['辣子鸡'],
                    ['酸菜鱼'],
                    ['黔江鸡杂'],
                    ['重庆小面']  
                ],
                '吉林':[
                    ['冷面', '拌冷面'],
                    ['锅包肉'],
                    ['大酱汤'],
                    ['杀猪菜'],
                    ['白肉血肠'],
                    ['鲶鱼炖茄子']
                ],
                '济南':[
                    ['九转大肠'],
                    ['糖醋鲤鱼'],
                    ['爆三样'],
                    ['奶汤蒲菜'],
                    ['甜沫'],
                    ['把子肉']
                ],
                '哈尔滨':[
                    ['杀猪菜'],
                    ['锅包肉'],
                    ['酱骨头']
                ],
                '昆明':[
                    ['过桥米线'],
                    ['烧饵块'],
                    ['稀豆粉'],
                    ['汽锅鸡'],
                    ['松茸'],
                    ['凉拌米线'],
                    ['豆花米线'],
                    ['香茅草烤鱼'],
                    ['老奶洋芋']
                ],
                '贵阳':[
                    ['酸汤鱼'],
                    ['豆腐圆子'],
                    ['炖鸡饭'],
                    ['豆米火锅'],
                    ['丝娃娃'],
                    ['肠旺面'],
                    ['泡椒板筋'],
                    ['花溪牛肉粉'],
                    ['花江狗肉']
                ],
                '长沙':[
                    ['臭豆腐', '长沙臭豆腐'],
                    ['口味虾'],
                    ['糖油粑粑'],
                    ['剁椒鱼头'],
                    ['龙脂猪血'],
                    ['毛氏红烧肉'],
                    ['黄鸭叫'],
                    ['麻辣仔鸡'],
                    ['酱板鸭']
                ],
                '太原':[
                    ['刀削面'],
                    ['莜面栲栳栳'],
                    ['过油肉 '],
                    ['荞面灌肠'],
                    ['羊肉蒸饺'],
                    ['羊杂割']
                ],
                '内江':[
                    ['牛肉面'],
                    ['炝锅面'],
                    ['羊肉汤']
                ]
            }
        },
        '5': {
            title: '全部分类'
        },
        '6': {
            title: '团购',
            sortType: 'groupon',
            listClassName: 'new_groupon',
            maxCount: 200
        },
        '7': {
            title: '惠吃首页'
        }
    };

    return groupId;
});